In [1]:
import pandas as pd
import numpy as np

In [4]:
df1 = pd.DataFrame({
    "id":[1,2,3,4,5,6,7,8,9,10],
    "salary" : [10000,30000,24000,12000,45000,55000,34000,23000, 45000, 120000]
})

In [5]:
df1

   id  salary
0   1   10000
1   2   30000
2   3   24000
3   4   12000
4   5   45000
5   6   55000
6   7   34000
7   8   23000
8   9   45000
9  10  120000

In [8]:
df2 = df1.sort_values(ascending =False, by=["id"])

In [9]:
df2

   id  salary
9  10  120000
8   9   45000
7   8   23000
6   7   34000
5   6   55000
4   5   45000
3   4   12000
2   3   24000
1   2   30000
0   1   10000

#### For loc[index,column]

In [12]:
df2.loc[1] # As the loc see the index value

id            2
salary    30000
Name: 1, dtype: int64

In [16]:
df1.loc[[9,0],["salary"]]

   salary
9  120000
0   10000

In [17]:
df2.loc[[9,0],["salary"]]

   salary
9  120000
0   10000

In [18]:
df1.iloc[1,1]

30000

In [23]:
type(df2.iloc[[3],[0,1]])

pandas.core.frame.DataFrame

In [25]:
type(df1.iloc[[1,9],1])

pandas.core.series.Series

In [29]:
df1.at[3,"salary"]

12000

In [34]:
df["salary"].value_counts()

salary
45000     2
10000     1
30000     1
24000     1
12000     1
55000     1
34000     1
23000     1
120000    1
Name: count, dtype: int64

In [37]:
type(df["salary"].unique())

numpy.ndarray

In [38]:
df1

   id  salary
0   1   10000
1   2   30000
2   3   24000
3   4   12000
4   5   45000
5   6   55000
6   7   34000
7   8   23000
8   9   45000
9  10  120000

In [39]:
df1["new_salary"] = df1["salary"].shift(1)

In [40]:
df1

   id  salary  new_salary
0   1   10000         NaN
1   2   30000     10000.0
2   3   24000     30000.0
3   4   12000     24000.0
4   5   45000     12000.0
5   6   55000     45000.0
6   7   34000     55000.0
7   8   23000     34000.0
8   9   45000     23000.0
9  10  120000     45000.0

In [43]:
df1["new_salary_two"] = df1["new_salary"].shift(-4)

In [44]:
df1

   id  salary  new_salary  new_salary_two
0   1   10000         NaN         12000.0
1   2   30000     10000.0         45000.0
2   3   24000     30000.0         55000.0
3   4   12000     24000.0         34000.0
4   5   45000     12000.0         23000.0
5   6   55000     45000.0         45000.0
6   7   34000     55000.0             NaN
7   8   23000     34000.0             NaN
8   9   45000     23000.0             NaN
9  10  120000     45000.0             NaN

In [47]:
df1["new_salary_two"] = df1["new_salary_two"].shift(-4)

In [48]:
df1

   id  salary  new_salary  new_salary_two
0   1   10000         NaN         23000.0
1   2   30000     10000.0         45000.0
2   3   24000     30000.0             NaN
3   4   12000     24000.0             NaN
4   5   45000     12000.0             NaN
5   6   55000     45000.0             NaN
6   7   34000     55000.0             NaN
7   8   23000     34000.0             NaN
8   9   45000     23000.0             NaN
9  10  120000     45000.0             NaN

#### drop column

In [51]:
df1.drop(columns = ["new_salary_two"], inplace = True)

In [52]:
df1

   id  salary  new_salary
0   1   10000         NaN
1   2   30000     10000.0
2   3   24000     30000.0
3   4   12000     24000.0
4   5   45000     12000.0
5   6   55000     45000.0
6   7   34000     55000.0
7   8   23000     34000.0
8   9   45000     23000.0
9  10  120000     45000.0

#### shift

In [53]:
df1.shift(1)

    id   salary  new_salary
0  NaN      NaN         NaN
1  1.0  10000.0         NaN
2  2.0  30000.0     10000.0
3  3.0  24000.0     30000.0
4  4.0  12000.0     24000.0
5  5.0  45000.0     12000.0
6  6.0  55000.0     45000.0
7  7.0  34000.0     55000.0
8  8.0  23000.0     34000.0
9  9.0  45000.0     23000.0

#### is operator

In [57]:
~df1["id"].isin(df2["id"])

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: id, dtype: bool

In [58]:
empty_df = pd.DataFrame({
    "id":[]
})

In [59]:
empty_df.empty

True